```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=si38]
module.aws_organization.aws_organizations_account.account: Refreshing state...
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=656889719924]
module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-09-06 12:15:26.556729641 +0000 UTC]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-09-06 12:15:26.419611589 +0000 UTC]
module.aws_logging.data.aws_region.current: Refreshing state... [id=us-east-1]
module.dns.module.dns["nonlive"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/46955869-b3c7-4936-b463-5caea37eb3f5]
module.dns.module.dns["live"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/2d620bca-b6a9-4c69-b045-9874dcbf5f30]
module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.dns.module.dns["nonlive"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/8135d581-d413-41d4-986c-d9ce3a96a52a]
module.aws_logging.aws_s3_bucket.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.dns.aws_route53_delegation_set.main: Refreshing state... [id=N00248303TX9WWXC3DUAK]
module.dns.module.dns["live"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/345cace1-2d73-4acc-a44f-d45752deb801]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=2777606739]
module.aws_logging.aws_kms_key.cloudtrail: Refreshing state... [id=f206c800-14d0-4612-86cd-bd6b80b2045e]
module.aws_api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.aws_logging.aws_cloudtrail.cloudtrail: Refreshing state... [id=cloudtrail]
module.dns.module.dns["nonlive"].aws_route53_zone.zone: Refreshing state... [id=Z09185361UA62H9QOZ65H]
module.dns.module.dns["live"].aws_route53_zone.zone: Refreshing state... [id=Z09171243VWGB0AD4XJAE]
module.dns.module.dns["live"].aws_route53_record.verification_record["scaffold.ly"]: Refreshing state... [id=Z09171243VWGB0AD4XJAE__7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly._CNAME]
module.dns.module.dns["nonlive"].aws_route53_record.verification_record["scaffoldly.dev"]: Refreshing state... [id=Z09185361UA62H9QOZ65H__5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev._CNAME]
module.aws_api_gateway.module.domain["nonlive"].aws_api_gateway_domain_name.domain: Refreshing state... [id=api.scaffoldly.dev]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-nonlive]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_rest_api.api: Refreshing state... [id=twevug835e]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-live]
module.aws_api_gateway.module.domain["live"].aws_api_gateway_domain_name.domain: Refreshing state... [id=api.scaffold.ly]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_rest_api.api: Refreshing state... [id=fghfrn4x2b]
module.aws_api_gateway.module.domain["nonlive"].aws_route53_record.api_record: Refreshing state... [id=Z09185361UA62H9QOZ65H_api.scaffoldly.dev_A]
module.aws_api_gateway.module.domain["live"].aws_route53_record.api_record: Refreshing state... [id=Z09171243VWGB0AD4XJAE_api.scaffold.ly_A]
module.aws_logging.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_logging.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-fghfrn4x2b-DEFAULT_4XX]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-twevug835e-DEFAULT_4XX]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_base_path_mapping.mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "mapping" {
      + api_id      = "twevug835e"
      + domain_name = "api.scaffold.ly"
      + id          = (known after apply)
      + stage_name  = "live"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "twevug835e"
      + stage_name    = "live"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration.health_get will be created
  + resource "aws_api_gateway_integration" "health_get" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + resource_id          = (known after apply)
      + rest_api_id          = "twevug835e"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_method.health_get will be created
  + resource "aws_api_gateway_method" "health_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "twevug835e"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_settings.settings will be created
  + resource "aws_api_gateway_method_settings" "settings" {
      + id          = (known after apply)
      + method_path = "health/GET"
      + rest_api_id = "twevug835e"
      + stage_name  = "live"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_resource.health will be created
  + resource "aws_api_gateway_resource" "health" {
      + id          = (known after apply)
      + parent_id   = "pauf57asoe"
      + path        = (known after apply)
      + path_part   = "health"
      + rest_api_id = "twevug835e"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "twevug835e"
      + stage_name    = "live"
    }

  # module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.execution_group will be created
  + resource "aws_cloudwatch_log_group" "execution_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "API-Gateway-Execution-Logs_twevug835e/live"
      + retention_in_days = 0
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_base_path_mapping.mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "mapping" {
      + api_id      = "fghfrn4x2b"
      + domain_name = "api.scaffoldly.dev"
      + id          = (known after apply)
      + stage_name  = "nonlive"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "fghfrn4x2b"
      + stage_name    = "nonlive"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration.health_get will be created
  + resource "aws_api_gateway_integration" "health_get" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + resource_id          = (known after apply)
      + rest_api_id          = "fghfrn4x2b"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method.health_get will be created
  + resource "aws_api_gateway_method" "health_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "fghfrn4x2b"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_settings.settings will be created
  + resource "aws_api_gateway_method_settings" "settings" {
      + id          = (known after apply)
      + method_path = "health/GET"
      + rest_api_id = "fghfrn4x2b"
      + stage_name  = "nonlive"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_resource.health will be created
  + resource "aws_api_gateway_resource" "health" {
      + id          = (known after apply)
      + parent_id   = "5ljwvt1yrb"
      + path        = (known after apply)
      + path_part   = "health"
      + rest_api_id = "fghfrn4x2b"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "fghfrn4x2b"
      + stage_name    = "nonlive"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.execution_group will be created
  + resource "aws_cloudwatch_log_group" "execution_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "API-Gateway-Execution-Logs_fghfrn4x2b/nonlive"
      + retention_in_days = 0
    }

Plan: 16 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```